# PipeFittingAndAccessoryData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData Class
Members See Also
---
The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipeFittingAndAccessoryData : IDisposable
```

Visual Basic
---
```text
Public Class PipeFittingAndAccessoryData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipeFittingAndAccessoryData : IDisposable
```

# Remarks
A FamilyInstance is the input data for the calculation, and the result is coefficient for each connector.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..PipeFittingAndAccessoryData
# See Also
PipeFittingAndAccessoryData Members
Autodesk.Revit.DB.Plumbing Namespace